In [48]:
import pandas as pd

In [49]:
train = pd.read_csv('./datasets/train.csv')

In [50]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [51]:
dataset=train[['Pclass', 'Sex', 'Age']]

In [52]:
dataset.head()

   Pclass     Sex   Age
0       3    male  22.0
1       1  female  38.0
2       3  female  26.0
3       1  female  35.0
4       3    male  35.0

In [53]:
dataset.to_csv('datasets/train.csv')

In [54]:
dataset.isnull().sum()

Pclass      0
Sex         0
Age       177
dtype: int64

In [61]:
import math
dataset["Age"] = dataset['Age'].fillna(math.floor(dataset['Age'].mean()))

C:\Users\Vadim\AppData\Local\Temp\ipykernel_19188\3832986406.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dataset["Age"] = dataset['Age'].fillna(math.floor(dataset['Age'].mean()))

In [62]:
dataset.isnull().sum()

Pclass    0
Sex       0
Age       0
dtype: int64

In [63]:
dataset

     Pclass     Sex   Age
0         3    male  22.0
1         1  female  38.0
2         3  female  26.0
3         1  female  35.0
4         3    male  35.0
..      ...     ...   ...
886       2    male  27.0
887       1  female  19.0
888       3  female  29.0
889       1    male  26.0
890       3    male  32.0

[891 rows x 3 columns]

In [64]:
dataset.to_csv('datasets/train.csv')

In [65]:
one_hot = pd.get_dummies(dataset["Sex"])

dum = dataset.drop("Sex",axis = 1)

dum = dum.join(one_hot)

In [66]:
dum

     Pclass   Age  female   male
0         3  22.0   False   True
1         1  38.0    True  False
2         3  26.0    True  False
3         1  35.0    True  False
4         3  35.0   False   True
..      ...   ...     ...    ...
886       2  27.0   False   True
887       1  19.0    True  False
888       3  29.0    True  False
889       1  26.0   False   True
890       3  32.0   False   True

[891 rows x 4 columns]

In [68]:
dum.to_csv('datasets/train.csv')